---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.Dispose
source: html/9b1280cb-0159-8637-8204-7e60f6c56b2e.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.Dispose Method

Releases all resources used by the AnalysisDisplayDiagramSettings

## Syntax (C#)
```csharp
public void Dispose()
```